app/controllers/home_controller.rb

						all_posts.push(post_json)
					end
					metadata = {:total => total.to_i}
					if Update.first != nil
---
SELECT  "updates".* FROM "updates"  ORDER BY "updates"."id" ASC LIMIT 1